-- 文件名: robot_cmd_define.lua
-- 说明: 给机器人发的命令id 的定义
-- 作者:
-- 版权所有:

--给机器人发的cmd id
----------------------------------------------------------------
-- 命令類型
----------------------------------------------------------------
TaskCmd_Sleep = 0
TaskCmd_GM    = 1
TaskCmd_Func  = 2
TaskCmd_Msg   = 3
TaskCmd_Max   = 4
----------------------------------------------------------------
-- 登录，角色创建，选择等 1 - 10
----------------------------------------------------------------
-- 连接服务器并登录
CMD_ID_CONNECT = 1
-- 创建角色
CMD_ID_CREATE_ROLE = 2
-- 选择角色
CMD_ID_CHOOSE_ROLE = 3
-- 退出账号
CMD_ID_LOG_OUT = 4
-- 计费登陆
CMD_ID_CHARGE_LOGIN = 5
-- 注册
CMD_ID_CHARGE_REGISTER = 6
-- 停止任務
CMD_ID_STOP_TASK_WORK = 7
----------------------------------------------------------------
-- 金錢相關 11-20
----------------------------------------------------------------
-- 虚拟币付费
CMD_ID_PAY_ITEM = 10

----------------------------------------------------------------
-- 系统相关操作 11-15
----------------------------------------------------------------
-- 切换场景
CMD_ID_SWITCH_SCENE_SELECT = 11
-- GM
CMD_ID_GM_CMD = 12
-- MSG
CMD_ID_MSG_CMD = 13

----------------------------------------------------------------
-- 移动行为 31-40
----------------------------------------------------------------
-- 开始行走
CMD_ID_START_MOVE = 31
-- 停止行走
CMD_ID_STOP_MOVE = 32

----------------------------------------------------------------
-- 容器,属性操作 41-60
----------------------------------------------------------------
-- gm 背包 80
CMD_ID_GM_FULL_PACK = 44
-- gm 背包 70 上下浮动
CMD_ID_GM_ADJUST_PACK = 45
-- gm 背包 40
CMD_ID_GM_NORMAL_PACK = 46
-- gm 背包 40 上下浮动
CMD_ID_GM_ADJUST_PACK_40 = 47
-- 一身神装
CMD_ID_GM_PERFECT_EQUIP = 48

----------------------------------------------------------------
-- 副本战斗相关 61-90
----------------------------------------------------------------
-- 请求切换到克隆场景战斗
CMD_ID_SWITCH_TO_SCENE = 61


-- 创建房间
CMD_ID_CREATE_ROOM = 63
-- 进入房间
CMD_ID_JOIN_ROOM = 64
-- 开始副本
CMD_ID_BEGIN_FIGHT = 65

----------------------------------------------------------------
-- 参数相关 220-... 240
----------------------------------------------------------------
CMD_ID_ROBOT_PROCESS_BASE = 220
